Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
#include "stm32_pogo_i2c.h"


/* Target specific definitions
 *  1. Startup delay
 *     STM32 target needs at least t-ms delay after reset msecs
 *  2. Target I2C slave dddress
 */
const u32 sysboot_i2c_startup_delay = 50; /* msec */

/* STM32MCU PID */
const u16 product_id = 0x460;

/* Flash memory characteristics from target datasheet (msec unit) */
const u32 flash_prog_time = 37; /* per page or sector */
const u32 flash_full_erase_time = 40 * 32; /* 2K erase time(40ms) * 32 pages */
const u32 flash_page_erase_time = 36; /* per page or sector */

/* Flash memory page(or sector) structure */
stm32_page_type stm32_memory_pages[] = {
  {2048, 32},
  {   0,  0}
};

stm32_map_type stm32_memory_map =
{
	0x08000000, /* flash memory starting address */
	0x1FFF0000, /* system memory starting address */
	0x1FFF7800, /* option byte starting address */
	(stm32_page_type *)stm32_memory_pages,
};

#define KEYBOARD_PATH_EXTERNAL_FW		"/sdcard/Firmware/KEYBOARD/keyboard.bin"


static u8 stm32_sysboot_checksum(u8 *src, u32 len);
static int stm32_sysboot_conv_memory_map(struct stm32_dev *data, u32 address, size_t len, stm32_erase_param_type *erase);
static int stm32_sysboot_i2c_erase(struct stm32_dev *data, u32 address, size_t len);
static int stm32_sysboot_i2c_read(struct stm32_dev *data, u32 address, u8 *dst, size_t len);
static int stm32_sysboot_i2c_write(struct stm32_dev *data, u32 address, u8 *src, size_t len);
static int stm32_sysboot_i2c_sync(struct stm32_dev *data, uint8_t *cmd);
static int stm32_sysboot_i2c_get_info(struct stm32_dev *data,
	uint8_t *cmd, uint32_t cmd_size, uint32_t data_size);
static int stm32_sysboot_i2c_read_unprotect(struct stm32_dev *data);
static int stm32_sysboot_i2c_info(struct stm32_dev *data);
static int stm32_sysboot_connect(struct stm32_dev *data);
static int stm32_sysboot_wait_for_ack(struct stm32_dev *data, unsigned long timeout);
static int stm32_sysboot_mcu_chip_command(struct stm32_dev *data, int command);
static int stm32_sysboot_mcu_validation(struct stm32_dev *data);
static void stm32_sysboot_disconnect(struct stm32_dev *data);
static int stm32_target_empty_check_status(struct stm32_dev *data);
static int stm32_target_option_update(struct stm32_dev *data);
static int stm32_target_empty_check_clear(struct stm32_dev *data);
static int stm32_dev_calchecksum(unsigned char *data, int size);
static int stm32_dev_firmware_update(struct stm32_dev *data, const u8 *fw_data, size_t size, int retry);
static void stm32_dev_save_version_of_bin(struct stm32_dev *data, const u8 *fw_info);
static int stm32_dev_check_firmware_version(struct stm32_dev *data, const u8 *fw_info);

/**
  * @brief  Erase the device memory
  * @param  destination(address), length
  * @retval 0 is success, others are fail.
  */
/**
  * @brief  Convert the device memory map to erase param. format.
  *         (start page and numbers to be erased)
  * @param  device memory address, length, erase ref.
  * @retval 0 is success, others are fail.
  */

 /**
  * @brief  Calculate 8-bit checksum.
  * @param  source data and length
  * @retval checksum value.
  */
static u8 stm32_sysboot_checksum(u8 *src, u32 len)
{
	u8 csum = *src++;

	if (len) {
		while (--len)
			csum ^= *src++;
	} else {
		csum = 0; /* error (no length param) */
	}

	return csum;
}

static int stm32_sysboot_conv_memory_map(struct stm32_dev *data, u32 address, size_t len, stm32_erase_param_type *erase)
{
	stm32_page_type *map = stm32_memory_map.pages;
	int found = 0;
	int total_bytes = 0, total_pages = 0;
	int ix = 0;
	int unit = 0;
	input_info(true, &data->client->dev, "%s\n", __func__);

	/* find out the matched starting page number and total page count */

	for (ix = 0; map[ix].size != 0; ++ix) {
		for (unit = 0; unit < map[ix].count; ++unit) {
			/* MATCH CASE: Starting address aligned and page number to be erased */
			if (address == stm32_memory_map.flashbase + total_bytes) {
				found++;
				erase->page = total_pages;
			}
			total_bytes += map[ix].size;
			total_pages++;
			/* MATCH CASE: End of page number to be erased */
			if ((found == 1) && (len <= total_bytes)) {
				found++;
				erase->count = total_pages - erase->page;
			}
		}
	}

	if (found < 2)
		/* Not aligned address or too much length inputted */
		return STM32_BOOT_ERR_DEVICE_MEMORY_MAP;

	if ((address == stm32_memory_map.flashbase) && (erase->count == total_pages)) {
		erase->page = 0xFFFF; /* mark the full erase */
		input_info(true, &data->client->dev, "%s super erase page\n", __func__);
	}

	return 0;
}


/**
  * @brief  Read the device memory
  * @param  source(address), destination, length
  * @retval 0 is success, others are fail.
  */
static int stm32_sysboot_i2c_read(struct stm32_dev *data, u32 address, u8 *dst, size_t len)
{
	u8 cmd[STM32_BOOT_I2C_REQ_CMD_LEN] = {0, }; //BOOT_I2C_REQ_CMD_LEN = 2
	u8 startaddr[STM32_BOOT_I2C_REQ_ADDRESS_LEN] = {0, }; //BOOT_I2C_REQ_ADDRESS_LEN = 5
	u8 nbytes[STM32_BOOT_I2C_READ_PARAM_LEN] = {0, }; //BOOT_I2C_READ_PARAM_LEN = 2
	int ret = 0;
	int retry = 0;

	/* build command */
	cmd[0] = STM32_BOOT_I2C_CMD_READ;
	cmd[1] = ~cmd[0];

	/* build address + checksum */
	*(u32 *)startaddr = HTONL(address);
	startaddr[STM32_BOOT_I2C_ADDRESS_LEN] = stm32_sysboot_checksum(startaddr, STM32_BOOT_I2C_ADDRESS_LEN);

	/* build number of bytes + checksum */
	nbytes[0] = len - 1;
	nbytes[1] = ~nbytes[0];

	for (retry = 0; retry < STM32_BOOT_I2C_SYNC_RETRY_COUNT; ++retry) {
		/* transmit command */
		ret = i2c_master_send(data->client_boot, cmd, sizeof(cmd));
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* transmit address */
		ret = i2c_master_send(data->client_boot, startaddr, sizeof(startaddr));
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

