Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
		/* transmit number of bytes */
		ret = i2c_master_send(data->client_boot, nbytes, sizeof(nbytes));
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

		/* receive payload */
		ret = i2c_master_recv(data->client_boot, dst, len);
		if (ret < 0)
		{
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		return 0;
	}

	return ret + STM32_BOOT_ERR_API_READ;
}

/**
  * @brief  Write the contents to the device memory
  * @param  destination(address), source, length
  * @retval 0 is success, others are fail.
  */
static int stm32_sysboot_i2c_write(struct stm32_dev *data, u32 address, u8 *src, size_t len)
{
	u8 cmd[STM32_BOOT_I2C_REQ_CMD_LEN] = {0, };
	u8 startaddr[STM32_BOOT_I2C_REQ_ADDRESS_LEN] = {0, };
	int ret = 0;
	int retry = 0;
	char * buf = NULL;
	/* build command */
	cmd[0] = STM32_BOOT_I2C_CMD_WRITE;
	cmd[1] = ~cmd[0];

	/* build address + checksum */
	*(u32 *)startaddr = HTONL(address);
	startaddr[STM32_BOOT_I2C_ADDRESS_LEN] = stm32_sysboot_checksum(startaddr, STM32_BOOT_I2C_ADDRESS_LEN);

	/* build number of bytes + checksum */

	buf = kzalloc(len + 2, GFP_KERNEL);
	if (!buf)
		return -ENOMEM;
	buf[0] = len -1;
	memcpy(&buf[1], src, len);
	buf[len+1] = stm32_sysboot_checksum(buf, len + 1);

	for (retry = 0; retry < STM32_BOOT_I2C_SYNC_RETRY_COUNT; ++retry) {
		/* transmit command */
		ret = i2c_master_send(data->client_boot, cmd, 2);
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed to wait ack after txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}


		/* transmit address */
		ret = i2c_master_send(data->client_boot, startaddr, 5);
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed to wait ack after txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

		/* transmit number of bytes + datas */

		ret = i2c_master_send(data->client_boot, buf, STM32_BOOT_I2C_WRITE_PARAM_LEN(len));
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		//msleep(len);
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WRITE_TMOUT);
		if (ret < 0) {
			input_info(true, &data->client->dev, "%s Failed to wait ack after txdata\n", __func__);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		kfree(buf);

		return 0;
	}
	msleep(2);
	kfree(buf);

	return ret + STM32_BOOT_ERR_API_WRITE;
}

static int stm32_sysboot_i2c_erase(struct stm32_dev *data, u32 address, size_t len)
{
	u8 cmd[STM32_BOOT_I2C_REQ_CMD_LEN] = {0, };
	stm32_erase_param_type erase;
	u8 xmit_bytes = 0;
	int ret = 0;
	int retry = 0;
	u8 *xmit = NULL;

	/* build command */
	cmd[0] = STM32_BOOT_I2C_CMD_ERASE;
	cmd[1] = ~cmd[0];

	/* build erase parameter */
	ret = stm32_sysboot_conv_memory_map(data, address, len, &erase);
	if (ret < 0)
		return ret + STM32_BOOT_ERR_API_ERASE;

	input_info(true, &data->client->dev, "%s erase.page 0x%x\n", __func__, erase.page);

	xmit = kmalloc(1024, GFP_KERNEL | GFP_DMA);
	if (xmit == NULL) {
		input_info(true, &data->client->dev, "%s out of memory\n", __func__);
		return ret + STM32_BOOT_ERR_API_ERASE;
	}

	memset(xmit, 0, 1024);

	for (retry = 0; retry < STM32_BOOT_I2C_SYNC_RETRY_COUNT; ++retry) {
		/* build full erase command */
		if (erase.page == 0xFFFF)		
			*(u16 *)xmit = (u16)erase.page;
		/* build page erase command */
		else
			*(u16 *)xmit = HTONS((erase.count - 1));

		xmit_bytes = sizeof(u16);
		xmit[xmit_bytes] = stm32_sysboot_checksum(xmit, xmit_bytes);
		xmit_bytes++;
		/* transmit command */
		stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
		ret = i2c_master_send(data->client_boot, cmd, sizeof(cmd));
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		
		stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);

		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* transmit parameter */
		ret = i2c_master_send(data->client_boot, xmit, xmit_bytes);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		//stm32_delay(2*32);
		ret = stm32_sysboot_wait_for_ack(data, (erase.page == 0xFFFF) ? STM32_BOOT_I2C_FULL_ERASE_TMOUT : STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

		/* case of page erase */
		if (erase.page != 0xFFFF) {
			/* build page erase parameter */
			register int ix;
			register u16 *pbuf = (u16 *)xmit;
			for (ix = 0; ix < erase.count; ++ix)
				pbuf[ix] = HTONS((erase.page + ix));

			input_info(true, &data->client->dev, "%s erase.count %d\n", __func__, erase.count);
			input_info(true, &data->client->dev, "%s &pbuf[ix] %pK,xmit %pK\n", __func__, &pbuf[ix], xmit);
			xmit_bytes = 2 * erase.count;
			*((u8 *)&pbuf[ix]) = stm32_sysboot_checksum(xmit, xmit_bytes);
			input_info(true, &data->client->dev, "%s xmit_bytes %d\n", __func__, xmit_bytes);
			xmit_bytes++;
			/* transmit parameter */
			ret = i2c_master_send(data->client_boot, xmit, xmit_bytes);
			if (ret < 0) {
				stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
				continue;
			}
			stm32_delay(250);
			/* wait for ACK response */
			ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_PAGE_ERASE_TMOUT(erase.count + 1));
			if (ret < 0) {
				stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
				continue;
			}
		}

		input_info(true, &data->client->dev, "%s finished\n", __func__);
		kfree(xmit);
		return 0;
	}

	kfree(xmit);
	return ret + STM32_BOOT_ERR_API_ERASE;
}


static int stm32_sysboot_connect(struct stm32_dev *data)
{
	struct stm32_devicetree_data *dtdata = data->dtdata;
	int ret = 0;

	input_info(true, &data->client->dev, "%s start\n", __func__);

	/* Assert NRST reset */
	gpio_direction_output(dtdata->mcu_nrst, 0);
	/* Change BOOT pins to System Bootloader */
	gpio_direction_output(dtdata->mcu_swclk, 1);
	/* NRST should hold down (Vnf(NRST) > 300 ns), considering capacitor, give enough time */
	stm32_delay(3);
	/* Release NRST reset */
	gpio_direction_output(dtdata->mcu_nrst, 1);
	/* Put little delay for the target prepared */
	stm32_delay(STM32_BOOT_I2C_STARTUP_DELAY);
	gpio_direction_output(dtdata->mcu_swclk, 0);

