Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
	/* STEP2. Send SYNC frame then waiting for ACK */
	ret = stm32_sysboot_mcu_chip_command(data, STM32_BOOT_I2C_CMD_SYNC);

	if (ret >= 0) {
		/* STEP3. When I2C mode, Turn to the MCU system boot mode once again for protocol == SYSBOOT_PROTO_I2C */
		/* Assert NRST reset */
		gpio_direction_output(dtdata->mcu_nrst, 0);
		gpio_direction_output(dtdata->mcu_swclk, 1);
		/* NRST should hold down (Vnf(NRST) > 300 ns), considering capacitor, give enough time */
		stm32_delay(3);
		/* Release NRST reset */
		gpio_direction_output(dtdata->mcu_nrst, 1);
		/* Put little delay for the target prepared */
		stm32_delay(STM32_BOOT_I2C_STARTUP_DELAY);
		gpio_direction_output(dtdata->mcu_swclk, 0);
	}

	return ret;
}

static int stm32_sysboot_wait_for_ack(struct stm32_dev *data, unsigned long timeout)
{
	int ret = 0;
	u32 retry = 3;
	char resp = 0;

	while (retry--) {
		ret = i2c_master_recv(data->client_boot, &resp, 1);
		if(ret >= 0) {
			if(!(resp == STM32_BOOT_I2C_RESP_ACK))
				input_info(true, &data->client->dev, "%s Failed to wait ack 0x%x \n", __func__, resp);
			return 0;
		} else {
			input_info(true, &data->client->dev, "%s Failed resp 0x%x , ret is %d	\n", __func__, resp, ret);
			if (time_after(jiffies, timeout)) {
				ret = -ETIMEDOUT;
				break;
			}
			stm32_delay(STM32_BOOT_I2C_INTER_PKT_BACK_INTVL + 2);
		}
	}
	return -1;

}

/**
  * @brief  Unprotect the read protect
  * @param  None
  * @retval 0 is success, others are fail.
  */
static int stm32_sysboot_i2c_read_unprotect(struct stm32_dev *data)
{
	u8 cmd[STM32_BOOT_I2C_REQ_CMD_LEN] = {0, };
	int ret = 0;
	int retry = 0;

	/* build command */
	cmd[0] = STM32_BOOT_I2C_CMD_READ_UNPROTECT;
	cmd[1] = ~cmd[0];

	input_info(true, &data->client->dev, "%s\n", __func__);

	for (retry = 0; retry < STM32_BOOT_I2C_SYNC_RETRY_COUNT; ++retry)
	{
		/* transmit command */
		ret = i2c_master_send(data->client_boot, cmd, sizeof(cmd));
		if (ret < 0)
		{
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_FULL_ERASE_TMOUT);
		if (ret < 0)
		{
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_FULL_ERASE_TMOUT);
		if (ret < 0)
		{
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

		return 0;
	}

	return ret + STM32_BOOT_ERR_API_READ_UNPROTECT;
}


/**
  * @brief  Getting STATUS of the TARGET empty check
  * @param  None
  * @retval 0: empty check reset, 1: empty check set, others are fail
  */
static int stm32_target_empty_check_status(struct stm32_dev *data)
{
	u32 value = 0;
	int ret = 0;
	input_info(true, &data->client->dev, "%s\n",__func__);

	/* Read first flash memory word ------------------------------------------- */
	ret = stm32_sysboot_i2c_read(data, stm32_memory_map.flashbase, (u8 *)&value, sizeof(value));
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s error: (%d)\n", __func__, ret);
		goto empty_check_status_fail;
	}

	input_info(true, &data->client->dev, "%s Flash Word: 0x%08X\n", __func__, value);

	if (value == 0xFFFFFFFF)
		return 1;

	return 0;

empty_check_status_fail:

	return -1;
}


static int stm32_target_option_update(struct stm32_dev *data)
{
	int ret = 0;
	int optionbyte = 0;
	int retry = 3;

	input_info(true, &data->client->dev, "%s\n", __func__);

	for (retry = 0; retry < 3; retry ++ ) {
		ret = stm32_sysboot_i2c_read(data, stm32_memory_map.optionbyte, (u8 *)&optionbyte, sizeof(optionbyte));
		if ((ret < 0) || ((optionbyte & 0xff) != 0xaa)) {
			ret = stm32_sysboot_i2c_read_unprotect(data);
			if (ret < 0)
				input_err(true, &data->client->dev, "%s Failed read_unprotect\n", __func__);
			else
				input_info(true, &data->client->dev, "%s succeed read_unprotect\n", __func__);

			stm32_delay(60);
			ret = stm32_sysboot_connect(data);
			/* try connection again */
			continue;
		}

		if (optionbyte & (1 << 24)) {
		/* Option byte write ---------------------------------------------------- */
			optionbyte &= ~(1 << 24);
			ret = stm32_sysboot_i2c_write(data, stm32_memory_map.optionbyte, (u8 *)&optionbyte, sizeof(optionbyte));
			if (ret < 0) {
				input_err(true, &data->client->dev, "%s Failed to write optionbyte \n", __func__);
				stm32_delay(1);
				continue;
			}
			input_err(true, &data->client->dev, "%s write optionbyte ok\n", __func__);
			//try connection again
		} else {
			input_err(true, &data->client->dev, "%s optionbyte is 0, success\n", __func__);
			return 0;
		}
	}

	return ret;
}

static int stm32_target_empty_check_clear(struct stm32_dev *data)
{
	int ret = 0;
	u32 optionbyte = 0;

	/* Option Byte read ------------------------------------------------------- */
	ret = stm32_sysboot_i2c_read(data, stm32_memory_map.optionbyte, (u8 *)&optionbyte, sizeof(optionbyte));
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s Failed to read Option Byte \n", __func__);
		goto empty_check_clear_fail;
	}

	input_info(true, &data->client->dev, "%s read Option Byte 0x%x\n", __func__, optionbyte);

	/* Option byte write (dummy: readed value) -------------------------------- */
	ret = stm32_sysboot_i2c_write(data, stm32_memory_map.optionbyte, (uint8_t *)&optionbyte, sizeof(optionbyte));
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s Failed to write Option Byte\n", __func__);
		goto empty_check_clear_fail;
	}
	input_err(true, &data->client->dev, "%s write Option Byte 0x%x\n", __func__, optionbyte);

	/* Put little delay for Target program option byte and self-reset */
	stm32_delay(150);
	/* Option byte read for checking protection status ------------------------ */
	/* 1> Re-connect to the target */
	ret = stm32_sysboot_connect(data);
	if (ret) {
		input_err(true, &data->client->dev, "%s Cannot connect to the target for RDP check (%d)\n", __func__, ret);
		goto empty_check_clear_fail;
	}

	/* 2> Read from target for status checking and recover it if needed */
	ret = stm32_sysboot_i2c_read(data, stm32_memory_map.optionbyte, (u8 *)&optionbyte, sizeof(optionbyte));
	if ((ret < 0) || ((optionbyte & 0x000000FF) != 0xAA)) {
		input_err(true, &data->client->dev, "%s Failed to read option byte from target (%d)\n", __func__, ret);
		/* Tryout the RDP level to 0 */
		ret = stm32_sysboot_i2c_read_unprotect(data);
		if (ret)
			input_err(true, &data->client->dev, "%s Readout unprotect Not OK ... Host restart and try again\n", __func__);
		else
			input_err(true, &data->client->dev, "%s Readout unprotect OK ... Host restart and try again\n", __func__);
		/* Put little delay for Target erase all of pages */
		stm32_delay(50);
		goto empty_check_clear_fail;
	}

