Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
	return 0;
empty_check_clear_fail:
	return -1;
}

static int stm32_sysboot_i2c_sync(struct stm32_dev *data, uint8_t *cmd)
{
	int ret = 0;

	input_info(true, &data->client->dev, "%s \n", __func__);
	/* set it and wait for it to be so */
	ret = stm32_i2c_write_burst(data->client_boot, cmd, 1);
	if (ret >= 0)
		input_info(true, &data->client->dev, "%s succeed to connect to target\n", __func__);
	else
		input_info(true, &data->client->dev, "%s Failed to connect target\n", __func__);
	return ret;
}

static int stm32_sysboot_i2c_get_info(struct stm32_dev *data,
	uint8_t *cmd, uint32_t cmd_size, uint32_t data_size)
{
	uint8_t recv[STM32_BOOT_I2C_RESP_GET_ID_LEN] = {0, };
	int ret = 0;
	int retry = 0;

	input_info(true, &data->client->dev, "%s cmd[0]:0x%x, cmd[1]:0x%x\n", __func__, cmd[0], cmd[1]);

	for (retry = 0; retry < STM32_BOOT_I2C_SYNC_RETRY_COUNT; ++retry) {
		/* transmit command */
		ret = stm32_i2c_write_burst(data->client_boot, cmd, cmd_size);
		if (ret < 0) {
			input_err(true, &data->client->dev, "%s Failed to send data, ret = %d\n", __func__, ret);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			input_err(true, &data->client->dev, "%s Failed to wait ack, ret = %d\n", __func__, ret);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* receive payload */
		ret = stm32_i2c_read_bulk(data->client_boot, recv, data_size);
		if (ret < 0) {
			input_err(true, &data->client->dev, "%s Failed to receive payload, ret = %d\n", __func__, ret);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}
		/* wait for ACK response */
		ret = stm32_sysboot_wait_for_ack(data, STM32_BOOT_I2C_WAIT_RESP_TMOUT);
		if (ret < 0) {
			input_err(true, &data->client->dev, "%s faield to wait ack,ret = %d\n", __func__, ret);
			stm32_delay(STM32_BOOT_I2C_SYNC_RETRY_INTVL);
			continue;
		}

		if (cmd[0] == STM32_BOOT_I2C_CMD_GET_ID) {
			memcpy((void *)&(data->icdata.id), &recv[1], recv[0] + 1);
			data->icdata.id = NTOHS(data->icdata.id);
			input_err(true, &data->client->dev, "%s succeed to get info id %d\n", __func__, data->icdata.id);
		} else if(cmd[0] == STM32_BOOT_I2C_CMD_GET_VER) {
			memcpy((void *)&(data->icdata.ver), recv , 1);
			input_err(true, &data->client->dev, "%s succeed to get info version %d\n", __func__, data->icdata.ver);
		}

		return 0;
	}

	return ret + cmd[0];
}

static int stm32_sysboot_mcu_chip_command(struct stm32_dev *data, int command)
{
	/* build command */
	uint8_t cmd[STM32_BOOT_I2C_REQ_CMD_LEN] = {0, };
	int ret = 0;
	input_info(true, &data->client->dev,"%s start\n", __func__);

	/* execute the command */
	switch (command) {
	case STM32_BOOT_I2C_CMD_GET:
		cmd[0] = 0x00;
		break;

	case STM32_BOOT_I2C_CMD_GET_VER:
		cmd[0] = 0x01;
		cmd[1] = ~cmd[0];
		ret = stm32_sysboot_i2c_get_info(data, cmd, 2, 1);
		break;

	case STM32_BOOT_I2C_CMD_GET_ID:
		cmd[0] = 0x02;
		cmd[1] = ~cmd[0];
		ret = stm32_sysboot_i2c_get_info(data, cmd, 2, 3);
		break;

	case STM32_BOOT_I2C_CMD_READ:
		cmd[0] = 0x11;
		break;

	case STM32_BOOT_I2C_CMD_WRITE:
		cmd[0] = 0x31;
		break;

	case STM32_BOOT_I2C_CMD_ERASE:
		cmd[0] = 0x44;
		break;

	case STM32_BOOT_I2C_CMD_GO:
		cmd[0] = 0x21;
		break;

	case STM32_BOOT_I2C_CMD_WRITE_UNPROTECT:
		cmd[0] = 0x73;
		break;

	case STM32_BOOT_I2C_CMD_READ_UNPROTECT:
		cmd[0] = 0x92;
		break;

	case STM32_BOOT_I2C_CMD_SYNC:
		/* UNKNOWN command */
		cmd[0] = 0xFF;
		ret = stm32_sysboot_i2c_sync(data, cmd);
		break;

	default:
		break;
		return -EINVAL;
	}

	return ret ;
}

static int stm32_sysboot_i2c_info(struct stm32_dev *data)
{
	int ret = 0;
	input_info(true, &data->client->dev, "mcu %s \n",__func__);
	memset((void *)&(data->icdata), 0x00, sizeof(data->icdata));
	stm32_sysboot_mcu_chip_command(data, STM32_BOOT_I2C_CMD_GET_ID);
	stm32_sysboot_mcu_chip_command(data, STM32_BOOT_I2C_CMD_GET_VER);
	return ret;
}

static void stm32_sysboot_disconnect(struct stm32_dev *data)
{
	struct stm32_devicetree_data *dtdata = data->dtdata;
	input_info(true, &data->client->dev, "%s start\n", __func__);
	/* Change BOOT pins to Main flash */
	gpio_direction_output(dtdata->mcu_swclk, 0);
	stm32_delay(1);
	/* Assert NRST reset */
	gpio_direction_output(dtdata->mcu_nrst, 0);
	/* NRST should hold down (Vnf(NRST) > 300 ns), considering capacitor, give enough time */
	stm32_delay(2);
	/* Release NRST reset */
	gpio_direction_output(dtdata->mcu_nrst, 1);
	stm32_delay(150);
}


static int stm32_sysboot_mcu_validation(struct stm32_dev *data)
{
	int ret = 0;
	input_info(true, &data->client->dev, "%s start\n", __func__);

	ret = stm32_sysboot_connect(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s Cannot connect to the target (%d) but skip\n", __func__, ret);
		goto validation_fail;
	}
	input_info(true, &data->client->dev, "%s Connection OK\n", __func__);

	ret = stm32_sysboot_i2c_info(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s Failed to collect the target info (%d)\n", __func__, ret);
		goto validation_fail;
	}

	input_info(true, &data->client->dev, "%s Get target info OK Target PID: 0x%X,"
			"Bootloader version: 0x%X\n", __func__, data->icdata.id,  data->icdata.ver);

	return 0;

validation_fail:
	stm32_sysboot_disconnect(data);
	input_info(true, &data->client->dev, "%s Failed target disconnected\n", __func__);

	return -1;
	
}

static int stm32_dev_calchecksum(unsigned char *data, int size)
{
	int i = 0;
	int result = 0;

	for (i = 0; i < size; i += 2)
		result = result + (0xFFFF & (((*(data + i + 1)) << 8) | (*(data + i))));

	return result;
}

static int stm32_dev_firmware_update(struct stm32_dev *data, const u8 *fw_data, size_t size, int retry)
{
	int ret = 0;
	int checksum = 0;
	int empty_check_en = 0;
	int len = 0;
	int i = 0;
	u32 address = 0;
	u32 wbytes = 0;
	u32 unit = STM32_DEV_FW_UPDATE_PACKET_SIZE;
	u8 senddata[STM32_DEV_FW_UPDATE_PACKET_SIZE] = "";
	u8 *tmp_data = NULL;

	tmp_data = kzalloc(size, GFP_KERNEL);
	if (!tmp_data) {
		input_err(true, &data->client->dev,
				"%s: Failed to kmalloc\n", __func__);
		return -ENOMEM;
	}

