Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
	memcpy(tmp_data, fw_data, size);

	/* verify checkSum */
	checksum = stm32_dev_calchecksum(tmp_data, size);
	input_info(true, &data->client->dev, "%s: cal checksum:0x%04X\n", __func__, checksum);

	/* boot loader mode */
	ret = stm32_sysboot_mcu_validation(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: Failed mcu validation\n", __func__);
		goto ERROR;
	}

	/* check_option_byte */
	stm32_target_option_update(data);

	/* check empty status */
	empty_check_en = stm32_target_empty_check_status(data);

	/* erase */

	stm32_sysboot_i2c_erase(data, stm32_memory_map.flashbase, 65536 - 2048);

	address = stm32_memory_map.flashbase;
	len = size;

	input_err(true, &data->client->dev, "%s len=%d\n", __func__, len);
		/* Write UserProgram Data */
	while (len > 0) {
		wbytes = (len > unit) ? unit : len;
	  	/* write the unit */
		for (i = 0; i < wbytes; i++ )
			senddata[i] = tmp_data[i];
		ret = stm32_sysboot_i2c_write(data, address, senddata, wbytes);
		if (ret < 0) {
			input_err(true, &data->client->dev, "%s Failed to write stm32_fw_debug i2c byte prog code\n", __func__);
			stm32_sysboot_disconnect(data);
			goto ERROR;
		} 
			address += wbytes;
			tmp_data += wbytes;
			len -= wbytes;
	}
	tmp_data = tmp_data - (address - stm32_memory_map.flashbase);

	if (empty_check_en > 0) {
		if (stm32_target_empty_check_clear(data)<0) {
			ret = -1;
			stm32_sysboot_disconnect(data);
			goto ERROR;
		}
	}

	ret = stm32_sysboot_i2c_read(data, STM32_IC_VERSION_OFFSET, data->mdata.ic_ver, STM32_DEV_FW_VER_SIZE);
	if (ret < 0)
		input_err(true, &data->client->dev, "%s Failed to read firmware ic ver :%d info (%d)\n",
			__func__, data->mdata.ic_ver[3], ret);



	/* sysboot_disconnect */
	stm32_sysboot_disconnect(data);
	
	input_info(true, &data->client->dev, "%s: done\n", __func__);

	ret = 0;
ERROR:
	kfree(tmp_data);
	return ret;
}

static void stm32_dev_save_version_of_bin(struct stm32_dev *data, const u8 *fw_info)
{
	data->mdata.phone_ver[0] = *(fw_info + STM32_DEV_VERSION_OFFSET);
	data->mdata.phone_ver[1] = *(fw_info + STM32_DEV_VERSION_OFFSET + 1);
	data->mdata.phone_ver[2] = *(fw_info + STM32_DEV_VERSION_OFFSET + 2);
	data->mdata.phone_ver[3] = *(fw_info + STM32_DEV_VERSION_OFFSET + 3);

	input_info(true, &data->client->dev, "%s %d%d%d%d\n", __func__,
			data->mdata.phone_ver[0], data->mdata.phone_ver[1],
			data->mdata.phone_ver[2], data->mdata.phone_ver[3]);
}

static int stm32_dev_check_firmware_version(struct stm32_dev *data, const u8 *fw_info)
{
//	u8 buff[1];
//	int i;
//	int ret;
	/*
	 * sec_ts_check_firmware_version
	 * return value = 1 : firmware download needed,
	 * return value = 0 : skip firmware download
	 */

	stm32_dev_save_version_of_bin(data, fw_info);

	input_info(true, &data->client->dev, "%s phone:%02x%02x%02x%02x ic:%02x%02x%02x%02x\n", __func__,
			data->mdata.phone_ver[0], data->mdata.phone_ver[1],
			data->mdata.phone_ver[2], data->mdata.phone_ver[3],
			data->mdata.ic_ver[0], data->mdata.ic_ver[1],
			data->mdata.ic_ver[2], data->mdata.ic_ver[3]);

	if (data->mdata.phone_ver[3] > data->mdata.ic_ver[3])
		return 1;
	else if (data->mdata.phone_ver[3] == 0xff)
		return 1;
	else if ((data->mdata.phone_ver[3] != 0xff) && (data->mdata.ic_ver[3] == 0xff))
		return 1;

	return 0;
	
}

static int stm32_dev_firmware_update_on_probe(struct stm32_dev *data)
{
	const struct firmware *fw_entry;
	char fw_path[STM32_DEV_MAX_FW_PATH];
	int result = -1;
	int ii = 0;
	int ret = 0;

	input_info(true, &data->client->dev, "%s start\n", __func__);

	if (data->dtdata->mcu_fw_name) {
		snprintf(fw_path, STM32_DEV_MAX_FW_PATH, "%s", data->dtdata->mcu_fw_name);
	} else {
		input_err(true, &data->client->dev, "%s: don't exist mcu_fw_name\n", __func__);
		return -1;
	}

	disable_irq(data->client->irq);

	if (request_firmware(&fw_entry, fw_path, &data->client->dev) !=  0) {
		input_err(true, &data->client->dev, "%s: Failed to request firmware\n", __func__);
		goto err_request_fw;
	}

	
	ret = stm32_sysboot_mcu_validation(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: Failed mcu validation\n", __func__);
		goto err_mcu_validation;
	}

	ret = stm32_sysboot_i2c_read(data, STM32_IC_VERSION_OFFSET, data->mdata.ic_ver, STM32_DEV_FW_VER_SIZE);
	if (ret < 0) {
		data->mdata.ic_ver[3] = 0;
		input_err(true, &data->client->dev, "%s Failed to read firmware ic ver :%d info (%d)\n",
				__func__, data->mdata.ic_ver[3], ret);
	}

	stm32_sysboot_disconnect(data);

	result = stm32_dev_check_firmware_version(data, fw_entry->data);
	if (result <= 0) {
		input_info(true, &data->client->dev, "%s: skip - fw update\n", __func__);
		goto err_result;
	} else {	/* firmup case */

		for (ii = 0; ii < 3; ii++) {
			ret = stm32_dev_firmware_update(data, fw_entry->data, fw_entry->size, ii);
			if (ret >= 0)
				break;
		}

		if (ret < 0) {
			result = -1;
			goto err_result;
		}
		result = 0;
	}

err_result:
err_mcu_validation:
	release_firmware(fw_entry);
err_request_fw:
	enable_irq(data->client->irq);
	return result;
}

static int stm32_dev_firmware_update_external(struct stm32_dev *data)
{
	struct file *fp;
	mm_segment_t old_fs;
	long fw_size, nread;
	int result = -1;
	int ii = 0;
	int ret = 0;

	old_fs = get_fs();
	set_fs(KERNEL_DS);

	input_info(true, &data->client->dev, "%s start\n", __func__);

	disable_irq(data->client->irq);

	fp = filp_open(KEYBOARD_PATH_EXTERNAL_FW, O_RDONLY, S_IRUSR);
	if (IS_ERR(fp)) {
		input_err(true, &data->client->dev, "%s: failed to open %s.\n", __func__,
				KEYBOARD_PATH_EXTERNAL_FW);
		result = -ENOENT;
		goto err_open;
	}

	fw_size = fp->f_path.dentry->d_inode->i_size;

	if (fw_size > 0) {
		unsigned char *fw_data;

		fw_data = vzalloc(fw_size);
		if (!fw_data) {
			input_err(true, &data->client->dev, "%s: failed to alloc mem\n", __func__);
			result = -ENOMEM;
			filp_close(fp, NULL);
			goto err_vzalloc;
		}
		nread = vfs_read(fp, (char __user *)fw_data,
				fw_size, &fp->f_pos);

		input_info(true, &data->client->dev,
				"%s: start, file path %s, size %ld Bytes\n",
				__func__, KEYBOARD_PATH_EXTERNAL_FW, fw_size);

