Svirusx/Nethunter-Kernel-S20_FE_5G/drivers/input/keyboard/stm/stm32l0/stm32_pogo_fw.c
		if (nread != fw_size) {
			input_err(true, &data->client->dev,
					"%s: failed to read firmware file, nread %ld Bytes\n",
					__func__, nread);
			result = -EIO;
		} else {		
			ret = stm32_sysboot_mcu_validation(data);
			if (ret < 0) {
				input_err(true, &data->client->dev, "%s: Failed mcu validation\n", __func__);
				vfree(fw_data);
				goto err_mcu_validation;
			}

			ret = stm32_sysboot_i2c_read(data, STM32_IC_VERSION_OFFSET, data->mdata.ic_ver, STM32_DEV_FW_VER_SIZE);
			if (ret < 0) {
				data->mdata.ic_ver[3] = 0;
				input_err(true, &data->client->dev, "%s Failed to read firmware ic ver :%d info (%d)\n",
						__func__, data->mdata.ic_ver[3], ret);
			}

			stm32_sysboot_disconnect(data);
				/* firmup case */

			for (ii = 0; ii < 3; ii++) {
				ret = stm32_dev_firmware_update(data, fw_data, fw_size, ii);
				if (ret >= 0)
					break;
			}

			if (ret < 0) {
				result = -1;
				vfree(fw_data);
				goto err_request_fw;
			}
			result = 0;
		}
		vfree(fw_data);
	}
err_request_fw:
err_mcu_validation:
err_vzalloc:
	filp_close(fp, NULL);
err_open:
	set_fs(old_fs);
	enable_irq(data->client->irq);
	return result;
}


int stm32_dev_firmware_update_menu(struct stm32_dev *data, int update_type)
{
	int ret = 0;

	/* Factory cmd for firmware update
	 * argument represent what is source of firmware like below.
	 *
	 * 0 : [BUILT_IN] Getting firmware which is for user.
	 * 1 : [UMS] Getting firmware from sd card.
	 * 2 : none
	 * 3 : [FFU] Getting firmware from air.
	 */

	switch (update_type) {
	case 0:
		ret = stm32_dev_firmware_update_on_probe(data);
		break;
	case 1:
		ret = stm32_dev_firmware_update_external(data);
		break;
	default:
		input_err(true, &data->client->dev, "%s: Not support command[%d]\n",
				__func__, update_type);
		break;
	}

	return ret;
}

int stm32_dev_get_ic_ver(struct stm32_dev *data)
{
	int ret;

	ret = stm32_sysboot_mcu_validation(data);
	if (ret < 0) {
		input_err(true, &data->client->dev, "%s: Failed mcu validation\n", __func__);
		return ret;
	}

	ret = stm32_sysboot_i2c_read(data, STM32_IC_VERSION_OFFSET, data->mdata.ic_ver, STM32_DEV_FW_VER_SIZE);
	if (ret < 0) {
		data->mdata.ic_ver[3] = 0;
		input_err(true, &data->client->dev, "%s Failed to read firmware ic ver :%d info (%d)\n",
				__func__, data->mdata.ic_ver[3], ret);
	}

	stm32_sysboot_disconnect(data);
	return ret;
}
